Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Architectures
zh_cn: 架构

source: Archives are created using the various archive tasks: Zip, Tar, Jar, War, and Ear.
zh_cn: 使用各种归档任务可以创建以下的归档文件： Zip, Tar, Jar, War, and Ear.

source: Artifacts (e.g. jars) produced by this project.
zh_cn: 由本项目生产的构件（如jar包）。

source: As already mentioned in Section 50.4.3, “Project dependencies”, Gradle offers project lib dependencies for this.
zh_cn: 第50.4.3节，“项目依赖”中已经提到，Gradle 为此提供了项目库依赖。

source: As an example, let's look at the Copy task provided by Gradle.
zh_cn: 作为一个例子，让我们看看由 Gradle 提供的Copy任务。

source: As can be seen in the first line above, classifiers can be used together with artifact only notation.
zh_cn: 如上面的第一行所示，classifiers 可以与artifact only notation 一起使用。

source: As described above, for each repository there is a separate metadata cache.
zh_cn: 如上文所述，每个仓库是一个单独的元数据缓存。

source: As described in Section 50.6.8, “More about Ivy resolvers”, you can use all the Ivy resolvers suitable for the purpose of uploading.
zh_cn: 如50.6.8节，“更多关于Ivy解析器的信息”中所述，你可以使用符合上传的所有Ivy解析器。

source: As mentioned before 'should run after' ordering rule will be ignored if it introduces an ordering cycle:
zh_cn: 如之前所述，如果“应该在之后运行”的排序规则引入了排序循环，那么它将会被忽略。

source: As mentioned earlier, a Maven module has only one artifact.
zh_cn: 正如前面提到的，一个 Maven 模块都只有一个 artifact。

source: As of Sonar 3.4, only one language per project can be analyzed.
zh_cn: 截至 Sonar 3.4，每个项目只可以分析一种语言。

source: As said above, if no module descriptor file can be found, Gradle by default downloads a jar with the name of the module.
zh_cn: 如上所述，如果找不到模块的描述符文件，默认情况下 Gradle 会下载一个与模块的名称相同的 jar 文件。

source: As such, if you are using the copy() method as part of a task action, you must explicitly declare all inputs and outputs in order to get the correct behavior.
zh_cn: 因此，如果您在任务的action里面使用copy()方法，必须显式声明所有的输入和输出以得到正确的行为。

source: As such, these plugins are not documented in the user guide.
zh_cn: 因此，这些插件都不在用户指南中记录。

source: As the build script executes, it configures this Project object:
zh_cn: 当构建脚本执行时，它会配置此Project对象：

source: As the property arctic is set in those build scripts, we have to do it this way.
zh_cn: 由于arctic属性被设置在那些构建脚本中，我们不得不这样做。

source: As this plugin is currently incubating, only 3 build init types are currently supported.
zh_cn: 由于这个插件目前仍是孵化状态，当前仅支持3个构建初始化类型。

source: As we continue to develop the native binary support in Gradle, the concept of Platform will be extended to include things like C-runtime version, Windows SDK, ABI, etc.
zh_cn: 随着我们继续开发 Gradle 的本地二进制支持，将扩展Platform的概念，包括 C-runtime版本，Windows SDK，ABI，等等。

source: As we extend the concept of project decoupling and provide features that take advantage of decoupled projects, we will also introduce new features to help you to solve common use cases (like configuration injection) without causing your projects to be coupled.
zh_cn: 当我们扩大项目解耦的概念，并提供利用了解耦项目的功能，我们也将引入新的功能来帮助你解决常见的情况（如配置注入）而不会导致你的项目耦合。

source: As we have already seen in the examples, the property() method allows to set new properties or override existing ones.
zh_cn: 正如我们在示例中已经看到的， property()方法允许设置新属性或重写现有的属性。

source: As we have said, we usually prefer to put project specific behavior into the build script of this project.
zh_cn: 正如前面所说的，我们通常更愿意把项目的特定行为放到这个项目的构建脚本中。

source: As we have seen, you can run a multi-project build by entering any subproject dir and execute the build from there.
zh_cn: 正如我们所看到的，你可以通过进入任何子项目的目录，运行多项目构建并在那里执行构建。

source: As well as configuring how things are to be signed (i.e. the signatory configuration), you must also specify what is to be signed.
zh_cn: 除了配置内容要如何签名（即签名配置），你还必须指定哪些文件要签名。

source: As well as considering artifacts downloaded from a different repository, Gradle will also attempt to reuse artifacts found in the local Maven Repository.
zh_cn: 同时考虑构件从不同的仓库下载，Gradle 还将试图重用本地 Maven 库中发现的构件。

source: As with dependencies, you can declare as many custom configurations as you like and assign artifacts to them.
zh_cn: 作为依赖，你可以如你喜欢尽可能多地定义自定义配置，并把构件指向它们。

source: As with other source types, you can configure the location of the windows resources that should in included in the binary.
zh_cn: 与其他源文件类型一样，您可以配置把windows 资源的位置包含进二进制文件中。

source: As with the Copy task, you specify the input files using the from() method, and can optionally specify where they end up in the archive using the into() method.
zh_cn: 像使用Copy任务一样，你需要使用from() 的方法指定输入的文件，并可以选择是否通过 into() 方法指定最终在存档中的位置。

source: As you can see in the example, transitive dependencies are included.
zh_cn: 正如你在示例中所看到的，传递依赖都被包括在内。

source: As you can see, you can either use a reference to an existing repository or create a new repository.
zh_cn: 正如你所见，你可以使用一个现有的仓库的引用，或者创建一个新的仓库。

source: Assembler sources to be included in a native binary are provided via a AssemblerSourceSet, which defines a set of Assembler source files.
zh_cn: 把汇编源码包含到原生二进制文件中，是通过一个 AssemblerSourceSet来实现的，它定义了一个汇编源文件集。

source: Assembles all the archives in the project.
zh_cn: 组装项目中所有的归类文件。

source: Assembles and uploads the artifacts in the specified configuration.
zh_cn: 组装并上传指定配置的构件。

source: Assembles the JAR file
zh_cn: 组装 JAR 文件

source: Assembles the application EAR file.
zh_cn: 组装应用程序 EAR 文件。

source: Assembles the application WAR file.
zh_cn: 组装应用程序 WAR 文件。

source: Assembles the artifacts in the specified configuration.
zh_cn: 组装指定配置的构件。

source: Assembles the distribution content and installs it on the current machine
zh_cn: 组装分发内容，并安装在当前计算机上

source: Assembles the given source set's classes directory.
zh_cn: 组装给定源集的类目录。

source: Assembles the production classes directory.
zh_cn: 组装生产的类目录。

source: Assembles the test classes directory.
zh_cn: 组装测试的类目录。

source: Assembly language support is provided by means of the 'assembler' plugin.
zh_cn: “assembler” 插件提供了汇编语言的支持。

source: Assume you are working on a single project, the :api project.
zh_cn: 假设你在 :api 这一个项目上。

source: Assuming a local Sonar server with out-of-the-box settings is up and running, no further mandatory configuration is required.
zh_cn: 假设一个本地的 Sonar 服务使用开箱即用的设置启动和运行，则不需要进一步的强制性的配置。

source: At a minimum, the Sonar plugin has to be applied to the project.
zh_cn: 最低要求是必须配置 Sonar 插件应用于该project。

source: At the heart of Gradle lies a rich extensible Domain Specific Language (DSL) based on Groovy.
zh_cn: Gradle 的核心在于基于Groovy的丰富而可扩展的域描述语言（DSL）。

source: At the moment daemon is coupled with particular version of Gradle.
zh_cn: 在这一刻，守护进程会被加上 Gradle 的特定版本号。

source: At the moment the default settings are pretty generous with regards to memory.
zh_cn: 目前的内存上的默认设置很大方。

source: At this stage, it is completely up to the build script to configure the relevant compiler/linker flags for each build type.
zh_cn: 在这个阶段，它就完全符合构建脚本来为每个构建类型配置相关的编译器/链接器标志。

source: At times a completely different module can serve as a replacement for a requested module dependency.
zh_cn: 有时一个完全不同的模块可以作为请求的模块依赖的替代者。

source: At times, the Gradle Dependency Cache can be out of sync with the actual state of the configured repositories.
zh_cn: 有时，Gradle 依赖缓存可能与已配置的仓库的实际状态不同步。

source: Automatic configuration of groovyClasspath
zh_cn: groovyClasspath 的自动配置

source: Automatic configuration of scalaClasspath
zh_cn: scalaClasspath 的自动配置

source: Automatic provisioning of Sonar Runner
zh_cn: 自动配置 Sonar Runner

source: Automatically applies
zh_cn: 自动应用

source: Automatically chooses between snarl, growl, and notify-send depending on the current operating system.
zh_cn: 根据当前的操作系统自动选择 snarl，growl，以及notify-send。

source: Available tool chains are searched in the order defined.
zh_cn: 可用的工具链将按照定义的顺序进行查找。

source: Base plugins
zh_cn: 基本插件

source: Based on this the Import-Package and the Export-Package values of the OSGi Manifest are calculated.
zh_cn: 并基于此计算 OSGi Manifest 中Import-Package和Export-Package的值。

source: Basically, in most of the cases excluding the transitive dependency should be done per configuration.
zh_cn: 基本上，在大多数情况下对每一个配置都是排除传递依赖。

source: Bear in mind that for some of those use cases there are better solutions than exclusions!
zh_cn: 记住，对于其中一些用例，有着比排除更好的解决方案！

source: Bear in mind that the alphabetical scheduling of decoupled tasks, known from the sequential execution, does not really work in parallel mode.
zh_cn: 记住，解耦的任务按字母顺序调度，并且这个顺序执行，而不是真的在并行模式下执行。

source: Because Gradle's build language is based on Groovy, and parts of Gradle are implemented in Groovy, Gradle already ships with a Groovy library (1.8.6 as of Gradle 1.6).
zh_cn: 由于 Gradle 的构建语言基于 Groovy 的，且部分的 Groovy 使用 Groovy 实现，因此 Gradle 已经带有了一个 Groovy 库 （截至 Gradle 1.6所带的 Groovy 库的版本是 1.8.6）。

source: Because a Groovy project is a Java project, whatever you can do with a Java project, you can also do with a Groovy project.
zh_cn: 因为一个Groovy项目也 是 一个Java项目，你在 Java 项目里能做的事，在 Groovy 项目中也能做。

source: Because of Gradle's cross project configuration every project has to be evaluated before any task gets executed.
zh_cn: 由于 Gradle 的跨项目配置每一个项目不得不在它们的任何任务执行之前，先对项目进行评估。

source: Because the sonarProperties block is evaluated lazily, properties of Gradle's object model can be safely referenced from within the block, without having to fear that they have not yet been set.
zh_cn: 因为sonarProperties块的评估是惰性的，Gradle 的对象模型的属性可以在块中被安全地引用，而无需担心它们还没有被赋值。

source: Because we are inspecting the task graph to determine if we are going to be publishing, we must set the signing.required property to a closure to defer the evaluation.
zh_cn: 由于我们正在检查任务图，以确定是否打算发布，我们必须将signing.required属性设置为一个闭包以推迟evaluation。

source: Before a task is executed for the first time, Gradle takes a snapshot of the inputs.
zh_cn: 在第一次执行任务之前，Gradle 对输入进行一次快照。

source: Before downloading an artifact, Gradle tries to determine the checksum of the required artifact by downloading the sha file associated with that artifact.
zh_cn: 在下载构件前，Gradle 试图通过下载与该项目关联的sha文件以确定所需的构件的校验和。

source: Before executing the sonarRunner task, all tasks producing output to be analysed by Sonar need to be executed.
zh_cn: 在执行sonarRunner任务前，所有产生输出以用于 Sonar 分析的需要都需要被执行。

source: Below are some examples of how to do this.
zh_cn: 下面是一些如何做到这一点的例子。

source: Below are some examples.
zh_cn: 下面是一些例子。

source: Below is a brief outline of how this process works.
zh_cn: 下面是这个过程的工作原理的简要概述。

source: Below is an example init script which changes how task execution and build completion is logged.
zh_cn: 下面是一个示例，在 init 脚本中修改任务执行和构建完成的日志打印。

source: Below is an example of how this is used in the build script:
zh_cn: 下面是关于如何在构建脚本中使用它的示例：

source: Below is an example which adds a test task to each project with the hasTests property set to true.
zh_cn: 下面是一个示例，将一个test任务添加到每个hasTests属性为 true 的project中。

source: Below is an example which adds a dependency from projectA:taskX to projectB:taskY:
zh_cn: 下面是一个示例，添加了从projectA:taskX到projectB:taskY的依赖关系：

source: Below is an example which executes the echo task.
zh_cn: 下面是执行 echo 任务的例子。

source: Below, we have changed our example to declare that it takes the source XML file as an input and produces output to a destination directory.
zh_cn: 下面，我们修改了我们的示例，声明它将 XML 源文件作为输入，并产生输出到一个目标目录。

source: Beside the build script files, Gradle defines a settings file.
zh_cn: 在构建脚本文件旁边，Gradle 定义了一个设置文件。

source: Beside the explicit properties of the OsgiManifest object you can add instructions.
zh_cn: 在 OsgiManifest 对象的显式属性旁边，你可以添加instructions。

source: Binaries produced by Gradle can be differentiated on build type, platform and flavor.
zh_cn: Gradle 产生的二进制文件可以区分 构建类型， 平台以及 flavor。

source: Binary variants are discussed in detail below.
zh_cn: 下面将详细讨论二进制 variant。

source: Bintray also supports sharing approved artifacts though the JCenter public repository to provide a single resolution address for all popular OSS java artifacts (see Section 50.6.2, “Maven JCenter repository”).
zh_cn: Bintray 还支持共享经过他们审核的构件，通过JCenter公共仓库，为所有普通的OSS java 构件提供一个单一的解析地址（见第 50.6.2 节，“Maven JCenter 存储库”）。

source: Both println statements print out the same property.
zh_cn: 这两个println语句打印出相同的属性。

source: Both also use repositories where the actual jars are placed together with their descriptor files, and both offer resolution for conflicting jar versions in one form or the other.
zh_cn: 这两者都使用了存储库，在存储库中实际的 jar 文件和它们的描述文件都放在一起，而且这两者通过窗口或其他的方式都提供了 jar 版本冲突的解决方案。

source: Both external dependencies (including associated source and javadoc files) and project dependencies are considered.
zh_cn: 它考虑到了外部依赖项 （包括相关联的源文件和 javadoc 文件） 和项目依赖项。

source: Both have emerged as standards for solving dependency conflicts, and while Gradle originally used Ivy under the hood for its dependency management.
zh_cn: 这两者都已成为解决依赖冲突的标准，而 Gradle 最初使用的是 Ivy 引擎的依赖管理。

source: Both have their own logging system.
zh_cn: 它们都有自己的日志系统。

source: Both the CUnit sources provided by your project and the generated launcher require the core CUnit headers and libraries.
zh_cn: 由你的项目和生成的启动器提供的两种 CUnit 源码，都需要核心 CUnit 头文件和库。

source: Both tools rely on descriptor XML files, which contain information about the dependencies of a particular jar.
zh_cn: 这两种工具都依赖于描述符 XML 文件，包含有关具体某个 jar 的依赖的信息。

source: Build Script Basics
zh_cn: 构建脚本基础知识

source: Build layout
zh_cn: 构建布局

source: Build script
zh_cn: 构建脚本

source: Build scripts are code
zh_cn: 构建脚本即代码

source: Building 'projectA:projectB:someTask' causes configuration of projectB.
zh_cn: 构建 “projectA:projectB:someTask”使项目B被配置。

source: Building a WAR file
zh_cn: 生成一个 WAR 文件

source: But Gradle also allows you to execute the build from within any subproject taking part in the build.
zh_cn: 但 Gradle 也允许你在属于这个构建的任何子项目中去执行构建。

source: But Gradle also offers to execute tasks by their absolute path (see also Section 56.5, “Project and task paths”):
zh_cn: 但 Gradle 也提供了按绝对路径执行任务（见第56.5节，“项目和任务路径”）︰

source: But Gradle does not look for an XML descriptor to figure them out but gets the information from the build file.
zh_cn: 但 Gradle 不会去查找一个 XML 描述符来找出它的依赖，而是从构建文件中获取信息。

source: But Gradle needs to create the build configuration for the whole multiproject build (see Chapter 56, Multi-project Builds).
zh_cn: 但 Gradle 需要创建整个多项目构建的构建配置（见第56章，多项目生成）。

source: But Gradle takes the concept of tasks further.
zh_cn: 但 Gradle 让任务的概念更深远。

source: But Gradle uses configuration injection as the usual way of defining common behavior.
zh_cn: 但 Gradle 使用配置注入来作为定义共同行为的常用方式。

source: But as we have already seen, we don't have to do it this way.
zh_cn: 但正如我们已经看到的，我们可以不这样做。

source: But before you can do an upload, you have to configure the upload task and define where to publish the artifacts to.
zh_cn: 但是在你可以上传之前，你必须配置上传任务，并定义发布这些构件的位置。

source: But even here the flexibility of Gradle can make your life easier.
zh_cn: 但即使是这样， Gradle 的灵活性也可以使你的生活更轻松。

source: But for example open source projects don't usually have a host for those products.
zh_cn: 但是比如开源项目通常没有主机用于这些产品。

source: But for such arbitrary layouts you need to execute the build from the directory where the settings file is located.
zh_cn: 但对于这种任意的布局，你需要在设置文件所在的目录执行构建。

source: But it asks for this information at execution time.
zh_cn: 但它在执行时才需要这些信息。

source: But it is easy for transitive dependency resolution to violate this contract.
zh_cn: 但传递依赖解析会很容易破坏这种协议。

source: But sometimes, even if the repository contains module descriptors, you want to download only the artifact jar, without the dependencies.
zh_cn: 但有时候，即使存储库包含了模块描述符，而你只是想下载 artifact jar而不下载它的依赖项。

source: But the draw-back is, that for the Gradle dependency management all dependencies are considered first level dependencies.
zh_cn: 但缺点是，对于 Gradle 依赖管理而言，所有的依赖都被认为是第一级依赖。

source: But this is kind of bloated.
zh_cn: 但这是种臃肿的解决方法。

source: But we think that the model of inheritance does not reflect the problem space of multi-project builds very well.
zh_cn: 但我们认为，继承模型并不能好地反映多项目构建的问题。

source: But when you enter steep territory Gradle does not become an obstacle and usually accompanies and carries you to the top of the mountain.
zh_cn: 当你进入一个陡峭的领域的时候，Gradle 不会成为你的障碍，并且通常会伴随着你并且带你到达峰顶。

source: But you can of course still use Maven2 repo and your custom repository as a repository for jars only and still enjoy transitive dependency management.
zh_cn: 但你当然也可以仍然使用 Maven2 仓库和你自定义的存储库，作为只放 jars和依然使用传递依赖管理的仓库。

source: But you can redefine the location of the root project in the settings file.
zh_cn: 但你可以在设置文件中重新定义根项目的位置。

source: By caching artifacts based on their SHA1 checksum, Gradle is able to maintain multiple versions of the same artifact.
zh_cn: 通过基于其 SHA1 校验和缓存构件，Gradle 是能够保持同一构件的多个版本。

source: By compiling only classes whose source code has changed since the previous compilation, and classes affected by these changes, incremental compilation can significantly reduce Scala compilation time.
zh_cn: 增量编译是只编译那些源代码在上一次编译之后有修改的类，及那些受这些修改影响到的类，它可以大大减少 Scala 的编译时间。

source: By default it is assumed that the location of the settings file is also the location of the root project.
zh_cn: 默认情况下，它假设设置文件的位置也是根项目的位置。

source: By default it scans all .class files.
zh_cn: 默认情况下它会扫描所有的.class文件。

source: By default the install task is associated with the archives configuration.
zh_cn: 默认情况下 install 任务是与archives配置相关联的。

source: By default, Gradle caches changing modules for 24 hours.
zh_cn: 默认情况下，Gradle 的变化模块将缓存 24 小时。

source: By default, Gradle caches dynamic versions and changing modules for 24 hours.
zh_cn: 默认情况下，Gradle 对动态版本和变化模块的缓存时间是24小时。

source: By default, Gradle caches dynamic versions for 24 hours.
zh_cn: 默认情况下，Gradle 缓存动态版本的时间为 24 小时。

source: By default, Gradle redirects standard output to the QUIET log level and standard error to the ERROR level.
zh_cn: 默认情况下，Gradle 将标准输出重定向到QUIET日志级别，把标准错误输出重写向到 ERROR 级别。

source: By default, Gradle will upload to the pattern defined by the url parameter, combined with the optional layout parameter.
zh_cn: 默认情况下，Gradle 将上传到由url参数以及可选的layout参数所联合定义的模式。

source: By default, a HTML report is generated.
zh_cn: 默认情况下，会生成一个 HTML 报告。

source: By default, a concise message will be logged for every failed test.
zh_cn: 默认情况下，对于每个失败的测试都只会打印一个简洁的消息。

source: By default, all Java and Scala code under src/main/scala will participate in joint compilation.
zh_cn: 默认情况下，在src/main/scala 下的所有 Java 和 Scala 代码都会进行联合编译。

source: By default, for any named component the AssemblerSourceSet contains .s source files under src/${name}/asm.
zh_cn: 默认情况下，对于任何命名的组件，AssemblerSourceSet包含了在src/${name}/asm中的.s源文件。

source: By default, for any named component the CSourceSet contains .c source files in src/${name}/c, and header files in src/${name}/headers.
zh_cn: 默认情况下，对于任何命名的组件，CSourceSet包含了在src/${name}/c中的.c源文件，和在src/${name}/headers中的头文件。

source: By default, for any named component the CppSourceSet contains .cpp source files in src/${name}/cpp, and header files in src/${name}/headers.
zh_cn: 默认情况下，对于任何命名的组件，CppSourceSet包含了在src/${name}/cpp中的.cpp源文件，和在src/${name}/headers中的头文件。

source: By default, for any named component the ObjectiveCSourceSet contains .m source files under src/${name}/objectiveC.
zh_cn: 默认情况下，对于任何命名的组件，ObjectiveCSourceSet包含了在src/${name}/objectiveC中的.m源文件。

source: By default, for any named component the ObjectiveCppSourceSet contains .mm source files under src/${name}/objectiveCpp.
zh_cn: 默认情况下，对于任何命名的组件，ObjectiveCppSourceSet包含了在src/${name}/objectiveCpp中的.mm源文件。

source: By default, for any named component the WindowsResourceSet contains .rc source files under src/${name}/rc.
zh_cn: 默认情况下，WindowsResourceSet为所有的命名组件包含了在src/${name}/rc下的.rc源文件。

source: By default, the Java compiler runs in the Gradle process.
zh_cn: 默认情况下，Java 编译器在 Gradle 过程中运行。

source: By default, the Sonar Runner plugin passes on the project's main source set as production sources, and the project's test source set as test sources.
zh_cn: 默认情况下， Sonar Runner 插件传给project 的main source set 将作为生产源文件，传给project 的test source sets 将作为测试源文件。

source: By default, the Sonar plugin will analyze the production sources in the main source set and the test sources in the test source set.
zh_cn: 默认情况下，Sonar 插件将分析main source set 里的生产源文件，以及test source sets 里的测试源文件。

source: By preconfiguring the Sonar Runner based on that information, the need for manual configuration is reduced significantly.
zh_cn: 基于这些信息对 Sonar Runner 进行预配置，减少了许多手动配置的需要。

source: By requiring special syntax for adding a property, Gradle can fail fast when an attempt is made to set a (predefined or extra) property but the property is misspelled or does not exist.
zh_cn: 通过添加属性所要求特殊的语法，Gradle 可以在你试图设置 （预定义的或额外的） 的属性，但该属性拼写错误或不存在时 fail fast。

source: By specifying that the distribution should include the task's output files (see Section 15.9.1, “Declaring a task's inputs and outputs”), Gradle knows that the task that produces the files must be invoked before the distribution can be assembled and will take care of this for you.
zh_cn: 通过指定分布包应包括的任务的输出文件 （见15.9.1章，“声明任务的输入和输出”），Gradle 将知道在组装 distribution 前哪些生产文件的任务必须被调用，并且会为你处理好。

source: By using 'must run after" ordering rule you can specify that taskB must always run after taskA, whenever both taskA and taskB are scheduled for execution.
zh_cn: 通过使用 “ 必须在之后运行”的排序规则，您可以指定 taskB 必须总是运行在 taskA 之后，无论taskA和taskB这两个任务在什么时候被调度执行。

source: C language support is provided by means of the 'c' plugin.
zh_cn: 'c' 插件提供了C 语言的支持。

source: C sources to be included in a native binary are provided via a CSourceSet, which defines a set of C source files and optionally a set of exported header files (for a library).
zh_cn: 把 C 源码包含到原生二进制文件中，是通过一个 CSourceSet来实现的，它定义了一个C源文件集以及（可选的）一个可导出的头文件（用于library）集

source: C++ language support is provided by means of the 'cpp' plugin.
zh_cn: 'cpp' 插件提供了C++ 语言的支持。

source: C++ sources to be included in a native binary are provided via a CppSourceSet, which defines a set of C++ source files and optionally a set of exported header files (for a library).
zh_cn: 把 C++ 源码包含到原生二进制文件中，是通过一个 CppSourceSet来实现的，它定义了一个C++源文件集以及（可选的）一个可导出的头文件（用于library）集

source: Caching
zh_cn: 缓存

source: Calling the uploadArchives task will generate the POM and deploys the artifact and the POM to the specified repository.
zh_cn: 调用uploadArchives任务将生成 POM，并将部署构件和 POM 到指定的仓库。

source: Can also set using a String or Number, e.g. '1.5' or 1.5.
zh_cn: 可以使用字符串或数字来设置，例如"1.5"或1.5。

source: Can also set using a String or a Number, e.g. '1.5' or 1.5.
zh_cn: 可以使用字符串或数字来设置，例如"1.5"或1.5。

source: Can be located on the local filesystem or at some remote location.
zh_cn: 可以位于本地文件系统上，或在某个远程的位置。

source: Can set using anything described in Section 16.1, “Locating files”.
zh_cn: 可以使用 16.1 章节，“查找文件”中所讲到的任何一种方式来设置。

source: Can set using anything described in Section 16.5, “Specifying a set of input files”.
zh_cn: 可以使用 16.5 章节，"指定一组输入文件"中所讲到的任何一个来设置。

source: Change
zh_cn: 修改的内容

source: Changing its state or the state of one of its dependencies will cause an exception.
zh_cn: 如果去修改它的状态，或者是它的某个依赖的状态，将会引发一个异常。

source: Changing what Gradle logs
zh_cn: 更改 Gradle 日志

source: Chapter 1. Introduction
zh_cn: 第一章. 介绍

source: Chapter 10. Web Application Quickstart
zh_cn: Chapter 10. Web 应用程序快速入门

source: Chapter 11. Using the Gradle Command-Line
zh_cn: 第十一章. 使用Gradle命令行

source: Chapter 12. Using the Gradle Graphical User Interface
zh_cn: 第十二章. 使用Gradle 图形用户界面

source: Chapter 13. Writing Build Scripts
zh_cn: 第十三章 编写构建脚本

source: Chapter 14. Tutorial - 'This and That'
zh_cn: 第十四章. 教程 - 杂七杂八

source: Chapter 15. More about Tasks
zh_cn: 第十五章. 任务详述

source: Chapter 16. Working With Files
zh_cn: 第十六章. 使用文件

source: Chapter 17. Using Ant from Gradle
zh_cn: 第十七章. 从 Gradle 中调用 Ant

source: Chapter 18. Logging
zh_cn: 第十八章. 日志

source: Chapter 19. The Gradle Daemon
zh_cn: 第十九章. Gradle 守护进程

source: Chapter 2. Overview
zh_cn: 第二章. 概述

source: Chapter 20. The Build Environment
zh_cn: 第二十章. 构建环境

source: Chapter 21. Gradle Plugins
zh_cn: 第二十一章. Gradle 插件

source: Chapter 22. Standard Gradle plugins
zh_cn: 第二十二章. 标准的 Gradle 插件

source: Chapter 23. The Java Plugin
zh_cn: 第 二十三章. Java 插件

source: Chapter 24. The Groovy Plugin
zh_cn: 第二十四章. Groovy 插件

source: Chapter 25. The Scala Plugin
zh_cn: 第二十五章. Scala 插件
